_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ГрафикиАктированияФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_ГрафикиАктированияФинансирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоКредитныеЭтапы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГрафика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыГрафиковАктированияФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАктирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВариантыАктирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдвиг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сдвиг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентЗалогаЗаТару</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыГрафиковАктированияФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыГрафиковАктированияФинансирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГрафикАктирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикФинансирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ГрафикиАктированияФинансирования/Forms/РазблокированиеРеквизитов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	РазрешитьРедактированиеВариантАктирования = Истина;
	РазрешитьРедактированиеВидГрафика  = Истина;
	РазрешитьРедактированиеКалендарь   = Истина;
	РазрешитьРедактированиеФормаОплаты = Истина;
	РазрешитьРедактированиеЭтапов      = Истина;

	Если Параметры.Свойство("ВидГрафика") Тогда
		Элементы.РазрешитьРедактированиеВариантАктирования.Видимость = (Параметры.ВидГрафика = Перечисления.УСОERP_ВидыГрафиковАктированияФинансирования.ГрафикАктирования);
		Элементы.РазрешитьРедактированиеЭтапов.Видимость = (Параметры.ВидГрафика = Перечисления.УСОERP_ВидыГрафиковАктированияФинансирования.ГрафикФинансирования);
	КонецЕсли;
		
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	           
	Если РазрешитьРедактированиеВидГрафика Тогда
		Результат.Добавить("ВидГрафика");
	КонецЕсли;
	
	Если РазрешитьРедактированиеВариантАктирования Тогда
		Результат.Добавить("ВариантАктирования");
	КонецЕсли;
	
	Если РазрешитьРедактированиеКалендарь Тогда
		Результат.Добавить("Календарь");
	КонецЕсли;
	
	Если РазрешитьРедактированиеФормаОплаты Тогда
		Результат.Добавить("ФормаОплаты");
	КонецЕсли;
	
	Если РазрешитьРедактированиеЭтапов Тогда
		Результат.Добавить("Этапы");
	КонецЕсли;
	
	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	
	РазрешитьРедактированиеВариантАктирования = Истина;
	РазрешитьРедактированиеВидГрафика  = Истина;
	РазрешитьРедактированиеКалендарь   = Истина;
	РазрешитьРедактированиеФормаОплаты = Истина;
	РазрешитьРедактированиеЭтапов      = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	РазрешитьРедактированиеВариантАктирования = Ложь;
	РазрешитьРедактированиеВидГрафика  = Ложь;
	РазрешитьРедактированиеКалендарь   = Ложь;
	РазрешитьРедактированиеФормаОплаты = Ложь;
	РазрешитьРедактированиеЭтапов      = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
